#ifndef C_DISPLAY_NOKIA5110_H
#define C_DISPLAY_NOKIA5110_H

//****************************************************************************************************
// ласс диспле€ NOKIA5110
//****************************************************************************************************

//****************************************************************************************************
//подключаемые библиотеки
//****************************************************************************************************
#include "cdisplaybased.h"

//****************************************************************************************************
//макроопределени€
//****************************************************************************************************

//****************************************************************************************************
//константы
//****************************************************************************************************

//****************************************************************************************************
//предварительные объ€влени€
//****************************************************************************************************

//****************************************************************************************************
// ласс диспле€ NOKIA5110
//****************************************************************************************************
class CDisplayNokia5110:public CDisplayBased
{
 public:
  //-перечислени€---------------------------------------------------------------------------------------
  //-структуры------------------------------------------------------------------------------------------
  //-константы------------------------------------------------------------------------------------------
 private:
  //-переменные-----------------------------------------------------------------------------------------
  uint16_t Left;
  uint16_t Right;
  uint16_t Top;
  uint16_t Bottom;
 
  uint16_t XPos;
  uint16_t YPos;
 
  uint8_t Screen[(DISPLAY_WIDTH*DISPLAY_HEIGHT)>>3];//матрица экрана
 public:
  //-конструктор----------------------------------------------------------------------------------------
  CDisplayNokia5110(void);
  //-деструктор-----------------------------------------------------------------------------------------
  virtual ~CDisplayNokia5110();
 public:
  //-открытые функции-----------------------------------------------------------------------------------
  virtual void Init(void);//инициализаци€ LCD-экрана
  virtual void SetWindow(uint16_t x_left,uint16_t y_top,uint16_t x_right,uint16_t y_bottom);//задать окно вывода пикселей
  virtual void OutColor(uint16_t color);//передать цвет точки
 private:
  //-закрытые функции-----------------------------------------------------------------------------------  
  void CE_One(void);//выставить на CE 1
  void CE_Zero(void);//выставить на CE 0

  void DIN_One(void);//выставить на DIN 1
  void DIN_Zero(void);//выставить на DIN 0

  void CLK_One(void);//выставить на CLK 1
  void CLK_Zero(void);//выставить на CLK 0

  void RST_One(void);//выставить на RST 1
  void RST_Zero(void);//выставить на RST 0

  void DC_One(void);//выставить на DC 1
  void DC_Zero(void);//выставить на DC 0

  void Write8(uint8_t value);//передать значение 8 бит
  void SetCommandMode(void);//установить режим команд
  void SetDataMode(void);//установить режим данных
 
  void Reset(void);//выполнить сброс 
};

#endif
