//****************************************************************************************************
//подключаемые библиотеки
//****************************************************************************************************
#include "cdisplaynokia5110.h"
#include "stm32f1xx_hal.h"

//****************************************************************************************************
//глобальные переменные
//****************************************************************************************************

//****************************************************************************************************
//макроопределения
//****************************************************************************************************

//контакты дисплея
#define NOKIA5110_GPIO_PIN_CE		GPIO_PIN_6
#define NOKIA5110_GPIO_CE				GPIOB

#define NOKIA5110_GPIO_PIN_RST	GPIO_PIN_5
#define NOKIA5110_GPIO_RST			GPIOB

#define NOKIA5110_GPIO_PIN_DC		GPIO_PIN_7
#define NOKIA5110_GPIO_DC				GPIOB

#define NOKIA5110_GPIO_PIN_CLK	GPIO_PIN_9
#define NOKIA5110_GPIO_CLK			GPIOB

#define NOKIA5110_GPIO_PIN_DIN	GPIO_PIN_8
#define NOKIA5110_GPIO_DIN			GPIOB


// PCD8544 Commandset
// ------------------
// General commands
#define PCD8544_POWERDOWN			0x04
#define PCD8544_ENTRYMODE			0x02
#define PCD8544_EXTENDEDINSTRUCTION	0x01
#define PCD8544_DISPLAYBLANK		0x00
#define PCD8544_DISPLAYNORMAL		0x04
#define PCD8544_DISPLAYALLON		0x01
#define PCD8544_DISPLAYINVERTED		0x05
// Normal instruction set
#define PCD8544_FUNCTIONSET			0x20
#define PCD8544_DISPLAYCONTROL		0x08
#define PCD8544_SETYADDR			0x40
#define PCD8544_SETXADDR			0x80
// Extended instruction set
#define PCD8544_SETTEMP				0x04
#define PCD8544_SETBIAS				0x10
#define PCD8544_SETVOP				0x80
// Display presets
#define LCD_BIAS					0x03	// Range: 0-7 (0x00-0x07)
#define LCD_TEMP					0x02	// Range: 0-3 (0x00-0x03)
#define LCD_CONTRAST				0x46	// Range: 0-127 (0x00-0x7F)


//****************************************************************************************************
//константы
//****************************************************************************************************

//****************************************************************************************************
//конструктор и деструктор
//****************************************************************************************************

//----------------------------------------------------------------------------------------------------
//конструктор
//----------------------------------------------------------------------------------------------------
CDisplayNokia5110::CDisplayNokia5110(void)
{ 
 Left=0;
 Right=0;
 Top=0;
 Bottom=0;
 XPos=0;
 YPos=0;
}
//----------------------------------------------------------------------------------------------------
//деструктор
//----------------------------------------------------------------------------------------------------
CDisplayNokia5110::~CDisplayNokia5110()
{
}

//****************************************************************************************************
//закрытые функции
//****************************************************************************************************

//----------------------------------------------------------------------------------------------------
//выставить на CE 1
//----------------------------------------------------------------------------------------------------
void CDisplayNokia5110::CE_One(void)
{
 HAL_GPIO_WritePin(NOKIA5110_GPIO_CE,NOKIA5110_GPIO_PIN_CE,GPIO_PIN_SET);
}
//----------------------------------------------------------------------------------------------------
//выставить на CE 0
//----------------------------------------------------------------------------------------------------
void CDisplayNokia5110::CE_Zero(void)
{
 HAL_GPIO_WritePin(NOKIA5110_GPIO_CE,NOKIA5110_GPIO_PIN_CE,GPIO_PIN_RESET);	
}
//----------------------------------------------------------------------------------------------------
//выставить на DIN 1
//----------------------------------------------------------------------------------------------------
void CDisplayNokia5110::DIN_One(void)
{
 HAL_GPIO_WritePin(NOKIA5110_GPIO_DIN,NOKIA5110_GPIO_PIN_DIN,GPIO_PIN_SET);	
}
//----------------------------------------------------------------------------------------------------
//выставить на DIN 0
//----------------------------------------------------------------------------------------------------
void CDisplayNokia5110::DIN_Zero(void)
{
 HAL_GPIO_WritePin(NOKIA5110_GPIO_DIN,NOKIA5110_GPIO_PIN_DIN,GPIO_PIN_RESET);	
}
//----------------------------------------------------------------------------------------------------
//выставить на CLK 1
//----------------------------------------------------------------------------------------------------
void CDisplayNokia5110::CLK_One(void)
{
 HAL_GPIO_WritePin(NOKIA5110_GPIO_CLK,NOKIA5110_GPIO_PIN_CLK,GPIO_PIN_SET);	
}
//----------------------------------------------------------------------------------------------------
//выставить на CLK 0
//----------------------------------------------------------------------------------------------------
void CDisplayNokia5110::CLK_Zero(void)
{
 HAL_GPIO_WritePin(NOKIA5110_GPIO_CLK,NOKIA5110_GPIO_PIN_CLK,GPIO_PIN_RESET);	
}
//----------------------------------------------------------------------------------------------------
//выставить на RST 1
//----------------------------------------------------------------------------------------------------
void CDisplayNokia5110::RST_One(void)
{
 HAL_GPIO_WritePin(NOKIA5110_GPIO_RST,NOKIA5110_GPIO_PIN_RST,GPIO_PIN_SET);	
}
//----------------------------------------------------------------------------------------------------
//выставить на RST 0
//----------------------------------------------------------------------------------------------------
void CDisplayNokia5110::RST_Zero(void)
{
 HAL_GPIO_WritePin(NOKIA5110_GPIO_RST,NOKIA5110_GPIO_PIN_RST,GPIO_PIN_RESET);	
}
//----------------------------------------------------------------------------------------------------
//выставить на DC 1
//----------------------------------------------------------------------------------------------------
void CDisplayNokia5110::DC_One(void)
{
 HAL_GPIO_WritePin(NOKIA5110_GPIO_DC,NOKIA5110_GPIO_PIN_DC,GPIO_PIN_SET);	
}
//----------------------------------------------------------------------------------------------------
//выставить на DC 0
//----------------------------------------------------------------------------------------------------
void CDisplayNokia5110::DC_Zero(void)
{
 HAL_GPIO_WritePin(NOKIA5110_GPIO_DC,NOKIA5110_GPIO_PIN_DC,GPIO_PIN_RESET);	
}

//----------------------------------------------------------------------------------------------------
//передать значение 8 бит
//----------------------------------------------------------------------------------------------------
void CDisplayNokia5110::Write8(uint8_t value)
{
 for(uint8_t n=0;n<8;n++,value<<=1)
 {
  if (value&0x80) DIN_One();
             else DIN_Zero();
  CLK_Zero();
	CLK_One();	 
 }	 
}
//----------------------------------------------------------------------------------------------------
//установить режим команд
//----------------------------------------------------------------------------------------------------
void CDisplayNokia5110::SetCommandMode(void)
{
 DC_Zero();
}
//----------------------------------------------------------------------------------------------------
//установить режим данных
//----------------------------------------------------------------------------------------------------
void CDisplayNokia5110::SetDataMode(void)
{
 DC_One();
}

//----------------------------------------------------------------------------------------------------
//выполнить сброс
//----------------------------------------------------------------------------------------------------
void CDisplayNokia5110::Reset(void)
{
 CE_One();
 DC_One();
 DIN_One();
 CLK_One();
 RST_One();    
 HAL_Delay(10);
 RST_Zero();
 HAL_Delay(10);
 RST_One();
 HAL_Delay(250);
 CE_Zero();
}

//****************************************************************************************************
//открытые функции
//****************************************************************************************************

//----------------------------------------------------------------------------------------------------
//инициализация LCD-экрана
//----------------------------------------------------------------------------------------------------
void CDisplayNokia5110::Init(void)
{
//настраиваем порты
 __HAL_RCC_GPIOB_CLK_ENABLE();

 //GPIO_Pin – номера выводов, которые конфигурируются. Пример для нескольких выводов:
 //GPIO_InitStructure.GPIO_Pin = GPIO_Pin_0 | GPIO_Pin_1 | GPIO_Pin_2;
 //GPIO_Speed – задает скорость для выбранных выводов.
 //GPIO_Mode – задает режим работы выводов. 

 //настраиваем параметры портов
 GPIO_InitTypeDef NOKIA5110_GPIO_Init;

 NOKIA5110_GPIO_Init.Mode=GPIO_MODE_OUTPUT_PP;
 NOKIA5110_GPIO_Init.Pull=GPIO_NOPULL;
 NOKIA5110_GPIO_Init.Speed=GPIO_SPEED_FREQ_HIGH;

 NOKIA5110_GPIO_Init.Pin=NOKIA5110_GPIO_PIN_CE;
 HAL_GPIO_Init(NOKIA5110_GPIO_CE,&NOKIA5110_GPIO_Init);

 NOKIA5110_GPIO_Init.Pin=NOKIA5110_GPIO_PIN_DIN;
 HAL_GPIO_Init(NOKIA5110_GPIO_DIN,&NOKIA5110_GPIO_Init);

 NOKIA5110_GPIO_Init.Pin=NOKIA5110_GPIO_PIN_RST;
 HAL_GPIO_Init(NOKIA5110_GPIO_RST,&NOKIA5110_GPIO_Init);

 NOKIA5110_GPIO_Init.Pin=NOKIA5110_GPIO_PIN_CLK;
 HAL_GPIO_Init(NOKIA5110_GPIO_CLK,&NOKIA5110_GPIO_Init);

 NOKIA5110_GPIO_Init.Pin=NOKIA5110_GPIO_PIN_DC;
 HAL_GPIO_Init(NOKIA5110_GPIO_DC,&NOKIA5110_GPIO_Init);

 //инициализируем дисплей
 Reset();
 uint8_t contrast=80;//контраст (от 0 до 127)
 SetCommandMode();
 Write8(PCD8544_FUNCTIONSET|PCD8544_EXTENDEDINSTRUCTION);
 Write8(PCD8544_SETVOP|contrast);
 Write8(PCD8544_SETTEMP|LCD_TEMP);
 Write8(PCD8544_SETBIAS|LCD_BIAS);
 Write8(PCD8544_FUNCTIONSET);
 Write8(PCD8544_SETYADDR|0);
 Write8(PCD8544_SETXADDR|0);
 SetDataMode(); 
 for (int16_t n=0;n<(DISPLAY_WIDTH*DISPLAY_HEIGHT)>>3;n++) 
 {
  Write8(0x00);
  Screen[n]=0x00;	 
 }
 SetCommandMode();
 Write8(PCD8544_DISPLAYCONTROL|PCD8544_DISPLAYNORMAL);
 
 Left=0;
 Right=0;
 Top=0;
 Bottom=0;
 XPos=0;
 YPos=0;
}
//----------------------------------------------------------------------------------------------------
//задать окно вывода пикселей
//----------------------------------------------------------------------------------------------------
void CDisplayNokia5110::SetWindow(uint16_t x_left,uint16_t y_top,uint16_t x_right,uint16_t y_bottom)
{
 Left=x_left;
 Right=x_right;
 Top=y_top;
 Bottom=y_bottom;
 XPos=Left;
 YPos=Top;
}
//----------------------------------------------------------------------------------------------------
//передать цвет точки
//----------------------------------------------------------------------------------------------------
void CDisplayNokia5110::OutColor(uint16_t color)
{
 int16_t offset=XPos*(DISPLAY_HEIGHT>>3)+(YPos>>3);
 int16_t shift=YPos&0x07;
 uint8_t c=Screen[offset];
 if (color!=COLOR_WHITE) c|=(1<<shift);
	                  else c&=0xff^(1<<shift);
 SetCommandMode();
 Screen[offset]=c;
 Write8(PCD8544_SETYADDR|(YPos>>3));
 Write8(PCD8544_SETXADDR|XPos);	
 SetDataMode();
 Write8(c);
 XPos++;
 if (XPos>=Right)
 {
	XPos=Left;  
  if (YPos<Bottom) YPos++;
 }
}
